# Pandas cheatsheet - by Daniel Cauchi

#### This is a notebook displaying my most used pandas functions alongside some other less used but very useful features

### Import pandas - the usual alias to use is pd

In [2]:
import pandas as pd

### Turning a dictionary into a dataframe

In [3]:
d = {
    'A': [1,2,3,4,5],
    'B': [6,7,8,9,10],
    'C': [11,12,13,14,15]
}

# Note: df is short for dataframe. It is a typical alias if we are only working with one dataframe
df = pd.DataFrame(data=d)

Documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html

### Viewing the dataframe

In [4]:
# It is always safe to show the dataframe in jupyter notebooks.
# If the dataframe is large, pandas will only show us the first and last few rows
# alongside the shape of the dataframe
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [5]:
# Alternatively, if we only want to see the first few rows, we can do:
df.head(n=3) # Note: the default value of n (3 in this case) is 5

   A  B   C
0  1  6  11
1  2  7  12
2  3  8  13

In [6]:
# Sometimes, the number of columns is too large to show.
# We can get just the column names by using:
df.columns

Index(['A', 'B', 'C'], dtype='object')

### We can also give indexes as row names, or use a pre-existing column as an index. The index is like our primary key in a database
Note: I rarely find playing with indexes useful, the default is usually sufficient

In [7]:
df.index = ['V', 'W', 'X', 'Y', 'Z']
df

# We could also do df.set_index('A') to use the pre-existing column 'A' as the index

   A   B   C
V  1   6  11
W  2   7  12
X  3   8  13
Y  4   9  14
Z  5  10  15

### Alternatively, we can transform a matrix into a dataframe, however we would still need to name the columns, otherwise the default names are 0, 1, 2, etc

In [8]:
mat = [
    [1,6,11],
    [2,7,12],
    [3,8,13],
    [4,9,14],
    [5,10,15]
]

# Note: Another useful parameter is 'copy' of type boolean
# so that if we edit the values in this dataframe, the original matrix remains the same
df = pd.DataFrame(data=mat, columns=['A','B','C'])
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

### Adding columns

In [9]:
# Similar to python dictionaries:
df['D'] = [16,17,18,19,20]

# We can also simply put all fields of a columns to be the same
df['E'] = 0

df

   A   B   C   D  E
0  1   6  11  16  0
1  2   7  12  17  0
2  3   8  13  18  0
3  4   9  14  19  0
4  5  10  15  20  0

In [10]:
# NOTE: We can also use this notation:

df.A

# I prefer the df['A'] version, although I should probably change this 
# as in some cases (like 'Row Iteration' below) we are forced to use the . notation

0    1
1    2
2    3
3    4
4    5
Name: A, dtype: int64

### Dropping columns
Full documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html

In [11]:
# Note: the following do the same thing. We cannot avoid not having the parameter names
# ie the word 'columns' or 'axis'. We must have one or the other. 
# simply writing df.drop(['A', 'C']) will not work
df.drop(columns=['A', 'C']) 
df.drop(['A', 'C'], axis=1)

# This returns a new dataframe, and does not change the original dataframe

# To actually drop the columns from the data frame we need to do one of the 2 below:
# df = df.drop(columns=['A', 'C'])
# df.drop(columns=['A', 'C'], inplace=True)

    B   D  E
0   6  16  0
1   7  17  0
2   8  18  0
3   9  19  0
4  10  20  0

### Getting some DataFrame information

In [12]:
df.describe()

              A          B          C          D    E
count  5.000000   5.000000   5.000000   5.000000  5.0
mean   3.000000   8.000000  13.000000  18.000000  0.0
std    1.581139   1.581139   1.581139   1.581139  0.0
min    1.000000   6.000000  11.000000  16.000000  0.0
25%    2.000000   7.000000  12.000000  17.000000  0.0
50%    3.000000   8.000000  13.000000  18.000000  0.0
75%    4.000000   9.000000  14.000000  19.000000  0.0
max    5.000000  10.000000  15.000000  20.000000  0.0

In [13]:
# Note: Shape is less confusing than len in the case of dataframes. The reason why is in the next cell
df.shape # gives (number of rows, number of columns)

(5, 5)

In [14]:
print( len(df) ) # len df gives the number of rows

print()

for x in df: # However if we iterate over the dataframe, we iterate over the column names
    print( x, end=' ' ) # Unrelated note: the default 'end' parameter of print is '\n'
                        # hence why python usually skips a line automatically after a print

5

A B C D E

### Selecting specific columns

In [15]:
df[ ['A', 'B', 'E'] ]

# Note how this is very similar to df['A'],
# but we are giving it an array of column names instead of one name

   A   B  E
0  1   6  0
1  2   7  0
2  3   8  0
3  4   9  0
4  5  10  0

### Shuffling
full documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html

In [16]:
df = df.sample(frac=1) # frac is the fraction of the dataframe to return
                       # Ex. if it was 0.5, only half the dataframe would be returned
                       # Alternatively we could set n, which is an integer number of rows to return
df

# we could do df.reset_index(inplace=True) if we wanted the indexes to be in order again,
# while keeping the order of the rows as they are

   A   B   C   D  E
1  2   7  12  17  0
3  4   9  14  19  0
2  3   8  13  18  0
4  5  10  15  20  0
0  1   6  11  16  0

### Sorting
full documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html

In [17]:
df = df.sort_values(by=['A', 'B', 'C', 'D']) # First sort by A, then by B, then by C, etc
                                             # This operation can also be done inplace
df
# we could also sort the columns themselves if we wanted

   A   B   C   D  E
0  1   6  11  16  0
1  2   7  12  17  0
2  3   8  13  18  0
3  4   9  14  19  0
4  5  10  15  20  0

reset_index documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html

### Queries

In [18]:
# Like numpy, we can take a column and perform a query on it
# The result is a column of type boolean

# The even numbers in column A:
df['A']%2 == 0

# The result is a series, which is a single column of a dataframe, which does not have a column name
# A series also has indexes, shown on the left
# These indexes will be used in the next cell

0    False
1     True
2    False
3     True
4    False
Name: A, dtype: bool

In [19]:
# So now what if we want to get the rows of the query which are true?

df[ df['A']%2 == 0 ]

# Note: the indexes of the series within the query must
# match the indexes of the dataframe we are querying

   A  B   C   D  E
1  2  7  12  17  0
3  4  9  14  19  0

#### Multiple conditions

In [20]:
df[
    (df['A']%2 == 0) | # | = OR condition
    [x in [6, 8] for x in df['B']] # Unrelated note: This is called 'list-comprehension' 
]                                  # and is standard python


# NOTE: THE PARENTHESES '()' ARE IMPORTANT

# & = AND condition

# | and & are essentially list operators which operate per element on booleans within the list, ex:
# [True, True, False, False] | [True, False, True, False] = [True, True, True, False]
# Note: These only work on numpy lists (and Series, which are technically numpy lists)

   A  B   C   D  E
0  1  6  11  16  0
1  2  7  12  17  0
2  3  8  13  18  0
3  4  9  14  19  0

### Row Iteration

In [21]:
# Rows are a bit weird in pandas. To access rows we can do the following:
df.iloc[0:2] # 2 not included

# The 'i' in iloc means 'integer'.
# This means that we get the rows by their integer position in the dataframe

# This is different from 'df.loc', which gets the items by their row label/index.

# Note: In the documentation, 'index' and 'row label' (not to be confused with 'column label')
# are used interchangeably

   A  B   C   D  E
0  1  6  11  16  0
1  2  7  12  17  0

In [22]:
# to iterate over rows, we can do:
for i, r in df.iterrows(): # Note: This returns an iterator of type: tuple of (index, row)
    print(i, r['A'])

0 1
1 2
2 3
3 4
4 5

In [23]:
# As iterrows returns a series for each row, it is not as efficient as:

for r in df.itertuples(): # returns an iterator of type: pandas.core.frame.Pandas
    print(r.A, end=' ') # Note, here we are forced to use the '.' notation (r.A insted of r['A'])

print()

print('r =', r) # r is the last row
print('Type of a row:', type(r))
print('Type of DataFrame:', type(df))

1 2 3 4 5
r = Pandas(Index=4, A=5, B=10, C=15, D=20, E=0)
Type of a row: <class 'pandas.core.frame.Pandas'>
Type of DataFrame: <class 'pandas.core.frame.DataFrame'>

### Per-element  operations

In [24]:
# Since we have already expressed that Series are very similar to numpy lists,
# we can do per-element operations such as:
df['A'] + df['B']

# Note: Elements are matched per-index, so if 2 Series (usually coming from 2 dataframes)
# have different indexes, errors will ensue

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [25]:
# Case when indexes are different (very unpredictable)
df.iloc[0:2]['A'] + df.iloc[2:4]['A']

0   NaN
1   NaN
2   NaN
3   NaN
Name: A, dtype: float64

#### The '.values' attribute

In [26]:
# The values property gives us the values of the dataframe or series,
# without any nosy indexes (or columns)

df.values

# This is useful for converting a dataframe back to a matrix
# Note that the values are not a copy of the dataframe values, rather a pointer/reference

array([[ 1,  6, 11, 16,  0],
       [ 2,  7, 12, 17,  0],
       [ 3,  8, 13, 18,  0],
       [ 4,  9, 14, 19,  0],
       [ 5, 10, 15, 20,  0]], dtype=int64)

In [27]:
# So to fix the addition issue we had before, we can do:

df.iloc[0:2]['A'] + df.iloc[2:4]['A'].values

# Note that if we had to put '.values' on the first series like so:
# df.iloc[0:2]['A'].values + df.iloc[2:4]['A']
# the indexes would be different but the values would be the same

0    4
1    6
Name: A, dtype: int64

### Pandas functions

In [28]:
# Besides having numpy functionality over columns
# ie being able to do for example: np.max(df['A']) to get the max value in column A
# pandas also has some similar functions of its own, namely:
print(df['A'].max())
print(df['A'].min())
print(df['A'].mean())
print(df['A'].unique())
print(df['A'].sum())

print( df['A'].iloc[:3].sum() ) # a simple complex example for using dataframes

5
1
3.0
[1 2 3 4 5]
15
6

### Types

In [29]:
# Each series has a type, and we can view it using:
df['A'].dtype

dtype('int64')

In [30]:
# We can change the type of a series using:
df['A'] = df['A'].astype('float')
df

# We may chnge the type for a number of reasons, namely:
# neatness (floats to integers),
# memory space (strings to categories),
# usability (date time type)

     A   B   C   D  E
0  1.0   6  11  16  0
1  2.0   7  12  17  0
2  3.0   8  13  18  0
3  4.0   9  14  19  0
4  5.0  10  15  20  0

In [31]:
# We can check all types using:
df.dtypes

A    float64
B      int64
C      int64
D      int64
E      int64
dtype: object

### Concatenation
concat complete documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html
merge complete documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

In [32]:
# Lets create a second dataframe which is a copy of our original
df2 = df.copy()

# Then we multiply every element in df2 by 2:
df2 = df2*2

df2

      A   B   C   D  E
0   2.0  12  22  32  0
1   4.0  14  24  34  0
2   6.0  16  26  36  0
3   8.0  18  28  38  0
4  10.0  20  30  40  0

In [33]:
# Now let's concatenate the rows to our original dataframe using pd.concat
df3 = pd.concat( [df, df2] ) # parameter must be an iteratable object
df3

# Note: This is quite a complex function and it is being used in its simplest example
# To concatenate horizontally, we use the parameter axis=1
# It also has SQL-like join capabilities, since concatenation can also be with columns

      A   B   C   D  E
0   1.0   6  11  16  0
1   2.0   7  12  17  0
2   3.0   8  13  18  0
3   4.0   9  14  19  0
4   5.0  10  15  20  0
0   2.0  12  22  32  0
1   4.0  14  24  34  0
2   6.0  16  26  36  0
3   8.0  18  28  38  0
4  10.0  20  30  40  0

In [34]:
# Notice that above we have repeating indexes. This may lead to confusion when using other operations
# To avoid this we simply do:
df3 = pd.concat( [df, df2], ignore_index=True ) # Note: for concat, copying is true by default
df3

      A   B   C   D  E
0   1.0   6  11  16  0
1   2.0   7  12  17  0
2   3.0   8  13  18  0
3   4.0   9  14  19  0
4   5.0  10  15  20  0
5   2.0  12  22  32  0
6   4.0  14  24  34  0
7   6.0  16  26  36  0
8   8.0  18  28  38  0
9  10.0  20  30  40  0

### Joining
join complete documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html

In [35]:
# Let's create a dataframe which is a copy of our original
dfcpy = df.copy()

# Suppose we have a new dataframe which we want to add to the this copy 
newData = [
    [4,6,41],
    [63,7,62],
    [1,8,31],
    [56,17,44],
    [2,12,15]
]
other = pd.DataFrame(data=newData, columns=['X','Y','Z'])

# We use the join function to add the columns of the new dataframe side by side to the original dataframe.
# the only required parameter is 'other' which is the dataframe we want to join with the original dataframe)
# note: the 'inplace' keyword/parameter is not available, so one must assign a value when joining.
# You can also use the 'how' keyword to handle the operation of the two DFs but for simplicity you don't need to use it

dfcpy.join(other)

     A   B   C   D  E   X   Y   Z
0  1.0   6  11  16  0   4   6  41
1  2.0   7  12  17  0  63   7  62
2  3.0   8  13  18  0   1   8  31
3  4.0   9  14  19  0  56  17  44
4  5.0  10  15  20  0   2  12  15

In [36]:
# Joining DataFrames using their indexes
# If you want to join 2 dataframes side by side with similar columns, you can do so but you have to provide a suffix,
# at least one: either lsuffix, rsuffix or both. Columns not common to the second column will not be affected

newDF1 = pd.DataFrame(data=newData, columns=['A','B','C'])
dfcpy.join(newDF1, lsuffix='_first', rsuffix='_second')

   A_first  B_first  C_first   D  E  A_second  B_second  C_second
0      1.0        6       11  16  0         4         6        41
1      2.0        7       12  17  0        63         7        62
2      3.0        8       13  18  0         1         8        31
3      4.0        9       14  19  0        56        17        44
4      5.0       10       15  20  0         2        12        15

### null values

In [37]:
# Lets take the second dataframe and put some null values in there
df2.loc[0, 'A'] = None
df2.loc[2, 'B'] = None
df2

      A     B   C   D  E
0   NaN  12.0  22  32  0
1   4.0  14.0  24  34  0
2   6.0   NaN  26  36  0
3   8.0  18.0  28  38  0
4  10.0  20.0  30  40  0

In [38]:
# To drop all rows which have some null values, we can use
df2.dropna() # We can do inplace=True for an inplace operation

      A     B   C   D  E
1   4.0  14.0  24  34  0
3   8.0  18.0  28  38  0
4  10.0  20.0  30  40  0

Full documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

In [39]:
# Checking if something is a null value
pd.isnull(df2)

       A      B      C      D      E
0   True  False  False  False  False
1  False  False  False  False  False
2  False   True  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False

In [40]:
# Also works on individual fields
pd.isnull(df2.iloc[0, 0])

True

In [41]:
# We can impute values into null using fillna()
df2.fillna('NULL NO MORE')

# We need inplace=True for it not to output a copy

              A             B   C   D  E
0  NULL NO MORE            12  22  32  0
1             4            14  24  34  0
2             6  NULL NO MORE  26  36  0
3             8            18  28  38  0
4            10            20  30  40  0

### CSV files

#### Writing to CSV
Full documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html

In [42]:
df.to_csv(path_or_buf='1.csv', index=False, header=True)

# path_or_buf is your filename / file buffer when using 'with open as f' (f would be the buffer)
# index means whether we want our index columns. In this case we avoid it
# header is wether we want the column names as the first row in the CSV
# Another important parameter is 'columns', to select which columns to store

#### Reading from CSV

In [43]:
df_read = pd.read_csv(filepath_or_buffer='1.csv')
df_read

# path_or_buf is your filename / file buffer when using 'with open as f' (f would be the buffer)
# Other important parateters:
#   index_col would be the column conidered as the 'primary key' which may be specified
#   usecols to only read certain columns

     A   B   C   D  E
0  1.0   6  11  16  0
1  2.0   7  12  17  0
2  3.0   8  13  18  0
3  4.0   9  14  19  0
4  5.0  10  15  20  0

#### Reading from and writing to CSV in chunks
When we have a large data file and we want to process it all, it is a good idea to read the data and process it in chunks

In [44]:
# This is an example of reading from '1.csv', processig tat data, then writing to '2.csv'

# First initialise the CSV file with the required header
df.iloc[0:0].to_csv(path_or_buf='2.csv', index=False, header=True)

with open('2.csv', 'a') as f: # open the csv file to append
    for i, chunk in enumerate(pd.read_csv(filepath_or_buffer='1.csv', chunksize=2)):
        # chunk is a smaller dataframe of <chunksize> (2 in this case) rows
        
        chunk += 10*(i+1) # process each element
        
        # write to the file buffer. This time do not put the header
        chunk.to_csv(f, index=False, header=False)

pd.read_csv(filepath_or_buffer='2.csv')

      A   B   C   D   E
0  11.0  16  21  26  10
1  12.0  17  22  27  10
2  23.0  28  33  38  20
3  24.0  29  34  39  20
4  35.0  40  45  50  30

### The SettingWithCopy Nightmare Warning

Sometimes we want to change elements within a dataframe. The issue with this is that, as discussed before, since a dataframe does not copy the elements from another source such as a matrix or another dataframe, but rather, only puts a reference, we may also change the original without intending to. In this final section we discuss a common scenario which may cause the warning and how to fix it.

In [46]:
df_train = df.iloc[:4]
df_test = df.iloc[4:]

df_train[ ['B', 'C'] ] = df_train[ ['B', 'C'] ] + 1
df_train

C:\Users\porte\Miniconda3\envs\py37\lib\site-packages\pandas\core\frame.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

     A   B   C   D  E
0  1.0   7  12  16  0
1  2.0   8  13  17  0
2  3.0   9  14  18  0
3  4.0  10  15  19  0

Above, df_train references df, so when we change df_train, we are also changing df (most likely intentionally, but we should do what we can to avoid warnings, rather than ignore them)

Here we have 2 solutions. 
1. We could simply copy the values when creating df_train and df_test.
2. Otherwise we can remove df from memory, which would be a good solution if we have limited memory.

In [47]:
# Solution 1:
df_train = df.iloc[:4].copy()
df_test = df.iloc[4:].copy()

df_train[ ['B', 'C'] ] = df_train[ ['B', 'C'] ] + 1
df_train

     A   B   C   D  E
0  1.0   8  13  16  0
1  2.0   9  14  17  0
2  3.0  10  15  18  0
3  4.0  11  16  19  0

In [48]:
# Solution 2:
df_train = df.iloc[:4].copy()
df_test = df.iloc[4:].copy()

del df

df_train[ ['B', 'C'] ] = df_train[ ['B', 'C'] ] + 1
df_train

     A   B   C   D  E
0  1.0   8  13  16  0
1  2.0   9  14  17  0
2  3.0  10  15  18  0
3  4.0  11  16  19  0

Alternatively, a VERY simple solution is to use the loc function, no need to copy the columns, this is a life-saver!: <br/>
Credit: https://stackoverflow.com/a/49190903/9042577

In [49]:
# Solution 3:

df_train.loc[:,['B','C']] = df_train[ ['B', 'C'] ] + 1
df_train

     A   B   C   D  E
0  1.0   9  14  16  0
1  2.0  10  15  17  0
2  3.0  11  16  18  0
3  4.0  12  17  19  0

### The MemoryError Warning

See https://stackoverflow.com/a/58686879/9042577

### Additional finalising notes

There are many possibilities with pandas, however the above cover my own regularly used functions from pandas. Other notable posssibilities are:
   * Integration with SQL
   * apply function (which is similar to map, but for pandas) https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html
   * get_dummies() to get one-hot encoded variables: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html
   * It is preferred that if the fields in a dataframe contains tuples, then split them into 2 columns when saving to CSV